[
{
    "model": "scrap.city",
    "pk": 1,
    "fields": {
        "name": "Moscow",
        "slug": "moscow"
    }
},
{
    "model": "scrap.city",
    "pk": 2,
    "fields": {
        "name": "Орёл",
        "slug": "oryol"
    }
},
{
    "model": "scrap.city",
    "pk": 3,
    "fields": {
        "name": "Amsterdam",
        "slug": "amsterdam"
    }
},
{
    "model": "scrap.programminglanguage",
    "pk": 1,
    "fields": {
        "name": "Python",
        "slug": "python"
    }
},
{
    "model": "scrap.programminglanguage",
    "pk": 2,
    "fields": {
        "name": "Java",
        "slug": "java"
    }
},
{
    "model": "scrap.vacancy",
    "pk": 1,
    "fields": {
        "url": "https://hh.ru/vacancy/41040272?query=python",
        "title": "Python Backend разработчик",
        "company": "ООО Декаст Инжиниринг",
        "description": "Требуемый опыт работы: 3–6 лет\r\nПолная занятость, полный день\r\nПривет, меня зовут Илья, я учился в МГТУ им. Баумана (ИУ7), в Технопарке Mail.ru Group, в NetCracker, и работал в Mail.ru Tarantool (https://github.com/tarantool/tarantool). Сейчас я - руководитель разработки приложений в компании Decast. (подробнее обо мне https://iproha94.github.io)\r\n\r\nDecast - крупнейший производитель и поставщик приборов учета воды и тепла на российском рынке, а также умных устройств. У нас несколько проектов: облачная IoT-платформа с интеграцией в цифровую экономику, умный город/дом, device-edge на raspberry-pi, уникальная библиотека декодинга сообщений от устройств на основе декларативного описания протоколов и энкодинга сообщений на основе json-схем, а также собственная WMS для нашего производства. Все проекты объединяются в масштабную экосистему!\r\n\r\nВ наших проектах на бэкенде мы используем: Python 3.8, Django 3.1, DRF, docker-compose, Gitlab-CI, Celery, rabbit-mq, pytest, InfluxDB, PostgreSQL, nginx, swagger и т.д., на фронтенде: React. Мы не только реализуем новую функциональность, но и обязательно выделяем время на рефакторинг, новые исследования, покрытие тестами (в основном проекте ~85%), внедряем новые практики и инструменты.\r\n\r\nТребования:\r\n\r\nопыт производственной разработки в команде на Django с Python 3 от 2-х лет;\r\nразработка на *nix + git.\r\nПлюсом будут:\r\n\r\nработа с большими данными, анализ данных, разработка парсеров и интеграций;\r\nподдержка высоконагруженных систем;\r\nиметь представление об HTTP, CoAP, MQTT, TCP, UDP, gRPC, REST, JSON, SOAP, XML;\r\nпрофильное образование: программирование/информатика/математика;\r\nинтерес к IoT, личное использование различных платформ умного дома;\r\nУсловия:\r\n\r\nоплата полностью декларируемая (официальная, \"белая\");\r\nработа в уютном офисе (чай, кофе, печеньки);\r\nдля иногородних предоставляется жилье в шаговой доступности от метро и офиса;\r\nграфик работы гибкий, но, желательно, с 12 до 18 всем сотрудникам быть в офисе;\r\nпосещение профильных конференций и курсов за счет компании;\r\nМосква: м. Полежаевская, м. Беговая, для сотрудников компании корпоративный транспорт от метро \"Улица 1905 года\". (но лично я хожу пешком, это полезно для здоровья, в условиях нашей сидячей работы)",
        "city": 1,
        "programming_language": 1,
        "timestamp": "2020-12-23"
    }
},
{
    "model": "scrap.vacancy",
    "pk": 2,
    "fields": {
        "url": "https://hh.ru/vacancy/40684972?query=python",
        "title": "Machine Learning Engineer (Computer Vision)",
        "company": "Tech5",
        "description": "Требуемый опыт работы: не требуется\r\nПолная занятость, полный день\r\nМы ищем начинающего специалиста на вакансию Junior machine learning engineer в московский R&D отдел, который занимается разработкой технологий биометрической идентификации.\r\n\r\nКто нам нужен:\r\n\r\nНачинающий специалист в области deep learning (machine vision, image recognition, face recognition) или выпускник с профильным образованием и хорошей математической подготовкой. Базовые знания нейронных сетей обязательны. Наша предметная область - распознавание лиц, отпечатков пальцев и радужки, а также связанные технологии. Необходимо умение программировать на любом языке, достаточное для решения собственных задач.\r\n\r\nЕсли в вашем резюме нет релевантного опыта работы, то, пожалуйста, сразу присылайте ссылки на свои проекты по ML, если они у вас есть - задача, описание подхода, код, результат. Это могут быть дипломные работы, хакатоны и пр. В противном случае мы предложим вам сделать тестовое задание.\r\n\r\nТребования:\r\n\r\nВысшее математическое образование: предпочтительно - МГУ (мехмат, ВМК, физфак), МФТИ, ШАД\r\nХорошая математическая подготовка (знание аналитической геометрии, линейной алгебры и математической статистики);\r\nУверенное владение языками программирования С, C++, Python\r\nПрактический опыт работы с фреймворками глубокого обучения MXNet/TensorFlow/Caffe\r\nЗнание английского языка на уровне чтения научных статей и переписки обязательно\r\nЧто мы предлагаем:\r\n\r\nБелую зарплату, официальное трудоустройство по ТК РФ\r\nГибкий график работы (возможно совмещение с учебой на старших курсах и в аспирантуре)\r\nДМС после испытательного срока\r\nКомфортный офис около м. Сокол, Щукинская",
        "city": 1,
        "programming_language": 1,
        "timestamp": "2020-12-23"
    }
},
{
    "model": "scrap.vacancy",
    "pk": 3,
    "fields": {
        "url": "https://hh.ru/vacancy/40738213?query=java",
        "title": "Программист Java",
        "company": "Сбер для экспертов Москва",
        "description": "Требуемый опыт работы: 3–6 лет\r\nПолная занятость, полный день\r\nИщем java разработчика к себе в команду. Ниже описание о нашем управлении и требования. Напишите, пожалуйста, ответным письмом интересно ли вам наше предложение.\r\n\r\nС нами ты сможешь как создавать классные продукты для клиентов, так и участвовать в технологической трансформации крупнейшего банка в стране.\r\n\r\nМы уже запустили такие сервисы , как:\r\n\r\nКарта путешественника;\r\nМультивалютная карта;\r\nЦифровая карта;\r\nПодписки;\r\nУстановка ПИН-кода в моб.приложении;\r\nАктивация карты;\r\nРазблокировка карты и многое другое, включая core - сервисы в концептуально новом исполнении для отделений Банка.\r\n\r\nПри этом мы учитываем развитие новых технологий и внедряем их в наши системы, не забывая про поддержание эталонной надежности.\r\n\r\nВпереди еще много вызовов! Тебя ждёт участие в абсолютно новых проектах, аналогов которым нет на рынке, при реализации которых мы обязаны не забывать про многомиллионную аудиторию(~60 млн. Клиентов).\r\n\r\nЕсли ты:\r\n\r\nРазрабатываешь на java(8-11);\r\nИмеешь опыт проектирования микросервисов и высоконагруженных систем;\r\nЛюбишь генерить новые идеи и подходы, не боишься ответственности;\r\nГотов к работе в команде, можешь конструктивно отстаивать свое мнение;\r\nЛюбишь изучать новые технологии и можешь придумать , как применить их на практике(адаптируя к прикладным задачам).\r\n\r\nКак мы работаем:\r\n\r\nВ офисе в стиле «чувствуй себя как дома», где много уютных мест и ты можешь с комфортом проводить рабочий день;\r\nПридерживаемся свободного стиля в одежде;\r\nЗанимаемся спортом (и ты давай с нами)!\r\nПаркуем машины на подземной парковке;\r\nУчимся каждый день чему-то новому не только друг у друга (свой университет, виртуальная школа, внутренние тренинги, семинары, митапы, мастер-классы).\r\nА ещё у нас ДМС, Льготные программы на кредитование и многое другое",
        "city": 1,
        "programming_language": 2,
        "timestamp": "2020-12-24"
    }
},
{
    "model": "scrap.vacancy",
    "pk": 4,
    "fields": {
        "url": "https://hh.ru/vacancy/40628334?query=java",
        "title": "Java developer",
        "company": "KUPIVIP.RU",
        "description": "Требуемый опыт работы: 3–6 лет\r\nПолная занятость, полный день\r\nТребования:\r\n\r\nВысшее техническое образование;\r\nОпыт работ ведущим разработчиком от 3-х лет;\r\nОтличные знания и опыт разработки на Java (JDK 8);\r\nТеоретические знания по информатике (алгоритмы, классы сложности, абстрактные типы и структуры);\r\nХорошее знание и опыт работы с Mongo DB, Elastic Search, Spring Boot;\r\nПонимание принципов работы многопоточных систем и умение его применять;\r\nОпыт разработки микросервисов;\r\nВозможность контроля полного цикла разработки (включая Java Script);\r\nПриоритет на производство поддерживаемого кода;\r\nАнглийский на уровне чтения документации.\r\nПлюсами будут:\r\n\r\n-Знание и опыт работы с базами данных (SQL, noSQL, document, columm-oriented, fulltext);\r\n\r\n-Работа с поисковыми системами\r\n\r\nОбязанности:\r\n\r\nПроектирование и создание архитектуры ПО;\r\nРазработка и отладка программного кода;\r\nНаписание, тестирование и поддержка старой и новой функциональности;\r\nРабота со средствами автоматизированного тестирования\r\nУсловия:\r\n\r\nГрафик работы: 5/2, пн-пт 09:00-18:00 (нам требуется сотрудник на долговременную работу в штат);\r\nОклад+полугодовые бонусы (100% белая компания);\r\nОформление по ТК РФ;\r\nПрофессиональная команда;\r\nРабота в динамично развивающейся, инновационной компании.",
        "city": 1,
        "programming_language": 2,
        "timestamp": "2020-12-24"
    }
}
]
